IlleniumDillon/MM32LLD/MM32/Sfr/MM32_TIM_1_8_Reg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-11-02 20:58:15
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-12-13 19:04:14
 * @FilePath: \CODE\MM32\Sfr\MM32_TIM_1_8_Reg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_TIM_1_8_REG_H_
#define _MM32_TIM_1_8_REG_H_

#include "MM32_RegBase.h"

#include "MM32_TIM_1_8_RegDef.h"

#define MOUDLE_TIM1		((MM32_TIM_1_8*)TIM1_BASE)

#define MOUDLE_TIM8		((MM32_TIM_1_8*)TIM8_BASE)

#define TIM1_CR1		((MM32_TIM_1_8_CR1*)(TIM1_BASE+0X00))

#define TIM1_CR2		((MM32_TIM_1_8_CR2*)(TIM1_BASE+0X04))

#define TIM1_SMCR		((MM32_TIM_1_8_SMCR*)(TIM1_BASE+0X08))

#define TIM1_DIER		((MM32_TIM_1_8_DIER*)(TIM1_BASE+0X0C))

#define TIM1_SR		((MM32_TIM_1_8_SR*)(TIM1_BASE+0X10))

#define TIM1_EGR		((MM32_TIM_1_8_EGR*)(TIM1_BASE+0X14))

#define TIM1_CCMR1		((MM32_TIM_1_8_CCMR1*)(TIM1_BASE+0X18))

#define TIM1_CCMR2		((MM32_TIM_1_8_CCMR2*)(TIM1_BASE+0X1C))

#define TIM1_CCER		((MM32_TIM_1_8_CCER*)(TIM1_BASE+0X20))

#define TIM1_CNT		((MM32_TIM_1_8_CNT*)(TIM1_BASE+0X24))

#define TIM1_PSC		((MM32_TIM_1_8_PSC*)(TIM1_BASE+0X28))

#define TIM1_ARR		((MM32_TIM_1_8_ARR*)(TIM1_BASE+0X2C))

#define TIM1_RCR		((MM32_TIM_1_8_RCR*)(TIM1_BASE+0X30))

#define TIM1_CCR1		((MM32_TIM_1_8_CCR1*)(TIM1_BASE+0X34))

#define TIM1_CCR2		((MM32_TIM_1_8_CCR2*)(TIM1_BASE+0X38))

#define TIM1_CCR3		((MM32_TIM_1_8_CCR3*)(TIM1_BASE+0X3C))

#define TIM1_CCR4		((MM32_TIM_1_8_CCR4*)(TIM1_BASE+0X40))

#define TIM1_BDTR		((MM32_TIM_1_8_BDTR*)(TIM1_BASE+0X44))

#define TIM1_DCR		((MM32_TIM_1_8_DCR*)(TIM1_BASE+0X48))

#define TIM1_DMAR		((MM32_TIM_1_8_DMAR*)(TIM1_BASE+0X4C))

#define TIM1_CCMR3		((MM32_TIM_1_8_CCMR3*)(TIM1_BASE+0X54))

#define TIM1_CCR5		((MM32_TIM_1_8_CCR5*)(TIM1_BASE+0X58))

#define TIM1_PDER		((MM32_TIM_1_8_PDER*)(TIM1_BASE+0X5C))

#define TIM1_CCR1FALL		((MM32_TIM_1_8_CCR1FALL*)(TIM1_BASE+0X60))

#define TIM1_CCR2FALL		((MM32_TIM_1_8_CCR2FALL*)(TIM1_BASE+0X64))

#define TIM1_CCR3FALL		((MM32_TIM_1_8_CCR3FALL*)(TIM1_BASE+0X68))

#define TIM1_CCR4FALL		((MM32_TIM_1_8_CCR4FALL*)(TIM1_BASE+0X6C))

#define TIM1_CCR5FALL		((MM32_TIM_1_8_CCR5FALL*)(TIM1_BASE+0X70))

#define TIM8_CR1		((MM32_TIM_1_8_CR1*)(TIM8_BASE+0X00))

#define TIM8_CR2		((MM32_TIM_1_8_CR2*)(TIM8_BASE+0X04))

#define TIM8_SMCR		((MM32_TIM_1_8_SMCR*)(TIM8_BASE+0X08))

#define TIM8_DIER		((MM32_TIM_1_8_DIER*)(TIM8_BASE+0X0C))

#define TIM8_SR		((MM32_TIM_1_8_SR*)(TIM8_BASE+0X10))

#define TIM8_EGR		((MM32_TIM_1_8_EGR*)(TIM8_BASE+0X14))

#define TIM8_CCMR1		((MM32_TIM_1_8_CCMR1*)(TIM8_BASE+0X18))

#define TIM8_CCMR2		((MM32_TIM_1_8_CCMR2*)(TIM8_BASE+0X1C))

#define TIM8_CCER		((MM32_TIM_1_8_CCER*)(TIM8_BASE+0X20))

#define TIM8_CNT		((MM32_TIM_1_8_CNT*)(TIM8_BASE+0X24))

#define TIM8_PSC		((MM32_TIM_1_8_PSC*)(TIM8_BASE+0X28))

#define TIM8_ARR		((MM32_TIM_1_8_ARR*)(TIM8_BASE+0X2C))

#define TIM8_RCR		((MM32_TIM_1_8_RCR*)(TIM8_BASE+0X30))

#define TIM8_CCR1		((MM32_TIM_1_8_CCR1*)(TIM8_BASE+0X34))

#define TIM8_CCR2		((MM32_TIM_1_8_CCR2*)(TIM8_BASE+0X38))

#define TIM8_CCR3		((MM32_TIM_1_8_CCR3*)(TIM8_BASE+0X3C))

#define TIM8_CCR4		((MM32_TIM_1_8_CCR4*)(TIM8_BASE+0X40))

#define TIM8_BDTR		((MM32_TIM_1_8_BDTR*)(TIM8_BASE+0X44))

#define TIM8_DCR		((MM32_TIM_1_8_DCR*)(TIM8_BASE+0X48))

#define TIM8_DMAR		((MM32_TIM_1_8_DMAR*)(TIM8_BASE+0X4C))

#define TIM8_CCMR3		((MM32_TIM_1_8_CCMR3*)(TIM8_BASE+0X54))

#define TIM8_CCR5		((MM32_TIM_1_8_CCR5*)(TIM8_BASE+0X58))

#define TIM8_PDER		((MM32_TIM_1_8_PDER*)(TIM8_BASE+0X5C))

#define TIM8_CCR1FALL		((MM32_TIM_1_8_CCR1FALL*)(TIM8_BASE+0X60))

#define TIM8_CCR2FALL		((MM32_TIM_1_8_CCR2FALL*)(TIM8_BASE+0X64))

#define TIM8_CCR3FALL		((MM32_TIM_1_8_CCR3FALL*)(TIM8_BASE+0X68))

#define TIM8_CCR4FALL		((MM32_TIM_1_8_CCR4FALL*)(TIM8_BASE+0X6C))

#define TIM8_CCR5FALL		((MM32_TIM_1_8_CCR5FALL*)(TIM8_BASE+0X70))

#endif